---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.CloudPoint.#ctor(System.Single,System.Single,System.Single,System.Int32)
source: html/3a03430e-0baa-d9ca-a887-97d8d00498ec.htm
---
# Autodesk.Revit.DB.PointClouds.CloudPoint.#ctor Method

Creates a new cloud point.

## Syntax (C#)
```csharp
public CloudPoint(
	float x,
	float y,
	float z,
	int color
)
```

## Parameters
- **x** (`System.Single`) - The X coordinate.
- **y** (`System.Single`) - The Y coordinate.
- **z** (`System.Single`) - The Z coordinate.
- **color** (`System.Int32`) - The color.